Revit 2027 API
FamilySymbolProfile.IsFlipped Property
Indicates if the symbol profile is flipped or not.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsFlipped { get; set; }
Public Property IsFlipped As Boolean
	Get
	Set
public:
property bool IsFlipped {
	bool get ();
	void set (bool value);
}
member IsFlipped : bool with get, set
Property Value
Boolean
See Also
Reference
FamilySymbolProfile Class
Autodesk.Revit.DB Namespace